In [1]:
from pyspark.sql import SparkSession
from pyspark import SparkContext

In [2]:
import pandas as pd
import numpy as np

In [3]:
spark = SparkSession.builder.appName("PersonData").getOrCreate()

In [4]:
print(spark.version)

3.4.1

In [5]:
data= spark.read.format('csv').\
option('inferSchema', 'true').\
option('header', 'true').\
option('path', 'Person_Data.csv').\
load()
data.printSchema()

root
 |-- S.no: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Occuption: string (nullable = true)
 |-- Education: string (nullable = true)

In [6]:
data.show()

+----+--------+---+------------------+-------------------+
|S.no|    Name|Age|         Occuption|          Education|
+----+--------+---+------------------+-------------------+
|   1|  Idrish| 36|        Kishan Lal|High School Diploma|
|   2|   Noyan| 30|          Engineer|    Master's Degree|
|   3|  Sameer| 25|           Teacher| Doctor of Medicine|
|   4|  Aakash| 35|            Doctor|  Bachelor's Degree|
|   5|   Rohit| 28|Software Developer|  Bachelor's Degree|
|   6|   Rahul| 40|        Accountant|  Bachelor's Degree|
|   7|   Sumit| 29|  Graphic Designer|       Juris Doctor|
|   8|   Ronak| 45|            Lawyer|  Bachelor's Degree|
|   9|Priyanka| 32| Marketing Manager|High School Diploma|
|  10| Fardeen| 27|           Student|  Bachelor's Degree|
|  11|  Noshad| 38|             Nurse|  Bachelor's Degree|
|  12|   Aakib| 31|         Architect|  Bachelor's Degree|
|  13|  Manish| 33|        Journalist|  Bachelor's Degree|
|  14|    Ansh| 42| Financial Analyst| Doctor of Pharmacy|
|  15|  Monish| 26|        Pharmacist|       Trade School|
|  16|    Annu| 36|       Electrician|    Culinary School|
|  17|    Aman| 29|              Chef|     Police Academy|
|  18|  Anupma| 39|    Police Officer|    Master's Degree|
|  19|  Salman| 34|         Librarian|  Bachelor's Degree|
|  20|   Rehan| 37| Real Estate Agent|    Master's Degree|
+----+--------+---+------------------+-------------------+
only showing top 20 rows

In [7]:
from pyspark.sql.functions import col,desc

In [8]:
data_1 = data.select("Age").\
filter(col("Age") >= 25).\
orderBy(desc("Age"))

In [9]:
data_1.printSchema()

root
 |-- Age: integer (nullable = true)

In [10]:
data_1.show()

+---+
|Age|
+---+
| 45|
| 44|
| 43|
| 42|
| 40|
| 39|
| 38|
| 37|
| 36|
| 36|
| 35|
| 34|
| 33|
| 32|
| 31|
| 30|
| 30|
| 29|
| 29|
| 28|
+---+
only showing top 20 rows

In [11]:
data_2 = data.agg({'Age': 'avg'})
data_3 = data.agg({'Age': 'max'})
data_4 = data.agg({'Age': 'min'})

data_2.show()
data_3.show()
data_4.show()

+--------+
|avg(Age)|
+--------+
|   33.72|
+--------+

+--------+
|max(Age)|
+--------+
|      45|
+--------+

+--------+
|min(Age)|
+--------+
|      25|
+--------+

In [12]:
data2= spark.read.format('csv').\
option('inferSchema','true').\
option('header','true').\
option('path','New_Data_Person.csv').\
load()
data.printSchema()

root
 |-- S.no: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Occuption: string (nullable = true)
 |-- Education: string (nullable = true)

In [13]:
data2.show()

+----+--------+---+------------------+-------------------+----------+
|S.no|    Name|Age|         Occuption|          Education|Department|
+----+--------+---+------------------+-------------------+----------+
|   1|  Idrish| 36|        Kishan Lal|High School Diploma|        HR|
|   2|   Noyan| 30|          Engineer|    Master's Degree|        IT|
|   3|  Sameer| 25|           Teacher| Doctor of Medicine|        IT|
|   4|  Aakash| 35|            Doctor|  Bachelor's Degree|        IT|
|   5|   Rohit| 28|Software Developer|  Bachelor's Degree|        IT|
|   6|   Rahul| 40|        Accountant|  Bachelor's Degree|        IT|
|   7|   Sumit| 29|  Graphic Designer|       Juris Doctor|        IT|
|   8|   Ronak| 45|            Lawyer|  Bachelor's Degree|        IT|
|   9|Priyanka| 32| Marketing Manager|High School Diploma|        IT|
|  10| Fardeen| 27|           Student|  Bachelor's Degree|        IT|
|  11|  Noshad| 38|             Nurse|  Bachelor's Degree|        IT|
|  12|   Aakib| 31|         Architect|  Bachelor's Degree|        IT|
|  13|  Manish| 33|        Journalist|  Bachelor's Degree|        IT|
|  14|   Adiba| 42| Financial Analyst| Doctor of Pharmacy|        IT|
|  15|  Monish| 26|        Pharmacist|       Trade School|        IT|
|  16|    Annu| 36|       Electrician|    Culinary School|        IT|
|  17|    Aman| 29|              Chef|     Police Academy|        IT|
|  18|  Anupma| 39|    Police Officer|    Master's Degree|        IT|
|  19|  Salman| 34|         Librarian|  Bachelor's Degree|        IT|
|  20|   Rehan| 37| Real Estate Agent|    Master's Degree|        IT|
+----+--------+---+------------------+-------------------+----------+
only showing top 20 rows